evaluation_tests/test2_webserver/tc2_html_curve/step07_rps2400__.txt
Running 30s test @ http://54.235.233.71/
  4 threads and 256 connections
  Thread calibration: mean lat.: 455.385ms, rate sampling interval: 1419ms
  Thread calibration: mean lat.: 470.383ms, rate sampling interval: 1557ms
  Thread calibration: mean lat.: 461.378ms, rate sampling interval: 1532ms
  Thread calibration: mean lat.: 485.024ms, rate sampling interval: 1692ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.93s   812.72ms   4.53s    65.62%
    Req/Sec   536.29     39.37   575.00     83.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.81s 
 75.000%    2.44s 
 90.000%    3.12s 
 99.000%    3.95s 
 99.900%    4.27s 
 99.990%    4.44s 
 99.999%    4.53s 
100.000%    4.53s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     419.071     0.000000            1         1.00
     907.775     0.100000         4236         1.11
    1206.271     0.200000         8461         1.25
    1432.575     0.300000        12707         1.43
    1618.943     0.400000        16920         1.67
    1810.431     0.500000        21147         2.00
    1922.047     0.550000        23259         2.22
    2042.879     0.600000        25386         2.50
    2156.543     0.650000        27483         2.86
    2299.903     0.700000        29617         3.33
    2439.167     0.750000        31728         4.00
    2529.279     0.775000        32784         4.44
    2625.535     0.800000        33828         5.00
    2727.935     0.825000        34891         5.71
    2848.767     0.850000        35948         6.67
    2977.791     0.875000        36995         8.00
    3055.615     0.887500        37540         8.89
    3121.151     0.900000        38051        10.00
    3198.975     0.912500        38582        11.43
    3287.039     0.925000        39120        13.33
    3379.199     0.937500        39638        16.00
    3426.303     0.943750        39910        17.78
    3475.455     0.950000        40172        20.00
    3526.655     0.956250        40430        22.86
    3586.047     0.962500        40698        26.67
    3649.535     0.968750        40963        32.00
    3684.351     0.971875        41098        35.56
    3719.167     0.975000        41225        40.00
    3758.079     0.978125        41362        45.71
    3803.135     0.981250        41494        53.33
    3854.335     0.984375        41621        64.00
    3876.863     0.985938        41686        71.11
    3903.487     0.987500        41756        80.00
    3930.111     0.989062        41816        91.43
    3962.879     0.990625        41884       106.67
    4001.791     0.992188        41948       128.00
    4022.271     0.992969        41981       142.22
    4046.847     0.993750        42015       160.00
    4069.375     0.994531        42047       182.86
    4093.951     0.995313        42080       213.33
    4116.479     0.996094        42113       256.00
    4128.767     0.996484        42130       284.44
    4149.247     0.996875        42149       320.00
    4161.535     0.997266        42163       365.71
    4184.063     0.997656        42180       426.67
    4210.687     0.998047        42197       512.00
    4218.879     0.998242        42207       568.89
    4227.071     0.998437        42212       640.00
    4243.455     0.998633        42223       731.43
    4255.743     0.998828        42229       853.33
    4272.127     0.999023        42238      1024.00
    4280.319     0.999121        42241      1137.78
    4288.511     0.999219        42245      1280.00
    4308.991     0.999316        42251      1462.86
    4313.087     0.999414        42254      1706.67
    4329.471     0.999512        42259      2048.00
    4337.663     0.999561        42260      2275.56
    4345.855     0.999609        42262      2560.00
    4362.239     0.999658        42265      2925.71
    4366.335     0.999707        42266      3413.33
    4378.623     0.999756        42268      4096.00
    4390.911     0.999780        42269      4551.11
    4403.199     0.999805        42270      5120.00
    4411.391     0.999829        42271      5851.43
    4427.775     0.999854        42272      6826.67
    4431.871     0.999878        42273      8192.00
    4435.967     0.999890        42274      9102.22
    4435.967     0.999902        42274     10240.00
    4468.735     0.999915        42275     11702.86
    4468.735     0.999927        42275     13653.33
    4476.927     0.999939        42276     16384.00
    4476.927     0.999945        42276     18204.44
    4476.927     0.999951        42276     20480.00
    4489.215     0.999957        42277     23405.71
    4489.215     0.999963        42277     27306.67
    4489.215     0.999969        42277     32768.00
    4489.215     0.999973        42277     36408.89
    4489.215     0.999976        42277     40960.00
    4534.271     0.999979        42278     46811.43
    4534.271     1.000000        42278          inf
#[Mean    =     1928.527, StdDeviation   =      812.723]
#[Max     =     4530.176, Total count    =        42278]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  64377 requests in 30.02s, 45.06MB read
Requests/sec:   2144.49
Transfer/sec:      1.50MB