evaluation_tests/test2_webserver/tc2_html_curve/step08_rps2800__.txt
Running 30s test @ http://54.235.233.71/
  4 threads and 256 connections
  Thread calibration: mean lat.: 1236.662ms, rate sampling interval: 4325ms
  Thread calibration: mean lat.: 1239.395ms, rate sampling interval: 4325ms
  Thread calibration: mean lat.: 1222.176ms, rate sampling interval: 4243ms
  Thread calibration: mean lat.: 1169.794ms, rate sampling interval: 4139ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.38s     1.18s    7.89s    63.40%
    Req/Sec   561.56     10.97   573.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.37s 
 75.000%    5.26s 
 90.000%    5.95s 
 99.000%    7.01s 
 99.900%    7.55s 
 99.990%    7.79s 
 99.999%    7.89s 
100.000%    7.89s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1914.879     0.000000            1         1.00
    2811.903     0.100000         4450         1.11
    3221.503     0.200000         8883         1.25
    3620.863     0.300000        13310         1.43
    4001.791     0.400000        17757         1.67
    4366.335     0.500000        22178         2.00
    4546.559     0.550000        24406         2.22
    4722.687     0.600000        26605         2.50
    4907.007     0.650000        28858         2.86
    5083.135     0.700000        31066         3.33
    5259.263     0.750000        33253         4.00
    5353.471     0.775000        34373         4.44
    5447.679     0.800000        35474         5.00
    5550.079     0.825000        36588         5.71
    5660.671     0.850000        37689         6.67
    5795.839     0.875000        38816         8.00
    5869.567     0.887500        39372         8.89
    5947.391     0.900000        39923        10.00
    6033.407     0.912500        40462        11.43
    6131.711     0.925000        41025        13.33
    6242.303     0.937500        41569        16.00
    6307.839     0.943750        41856        17.78
    6377.471     0.950000        42131        20.00
    6451.199     0.956250        42406        22.86
    6529.023     0.962500        42682        26.67
    6610.943     0.968750        42957        32.00
    6655.999     0.971875        43093        35.56
    6705.151     0.975000        43231        40.00
    6758.399     0.978125        43374        45.71
    6815.743     0.981250        43508        53.33
    6885.375     0.984375        43651        64.00
    6918.143     0.985938        43719        71.11
    6955.007     0.987500        43791        80.00
    6991.871     0.989062        43864        91.43
    7028.735     0.990625        43926       106.67
    7069.695     0.992188        43991       128.00
    7098.367     0.992969        44031       142.22
    7122.943     0.993750        44061       160.00
    7155.711     0.994531        44097       182.86
    7192.575     0.995313        44135       213.33
    7237.631     0.996094        44168       256.00
    7266.303     0.996484        44184       284.44
    7299.071     0.996875        44202       320.00
    7327.743     0.997266        44216       365.71
    7372.799     0.997656        44235       426.67
    7413.759     0.998047        44251       512.00
    7430.143     0.998242        44260       568.89
    7454.719     0.998437        44268       640.00
    7487.487     0.998633        44278       731.43
    7516.159     0.998828        44286       853.33
    7553.023     0.999023        44294      1024.00
    7573.503     0.999121        44299      1137.78
    7585.791     0.999219        44303      1280.00
    7610.367     0.999316        44308      1462.86
    7634.943     0.999414        44312      1706.67
    7659.519     0.999512        44316      2048.00
    7663.615     0.999561        44318      2275.56
    7671.807     0.999609        44320      2560.00
    7688.191     0.999658        44323      2925.71
    7696.383     0.999707        44325      3413.33
    7716.863     0.999756        44327      4096.00
    7720.959     0.999780        44329      4551.11
    7720.959     0.999805        44329      5120.00
    7737.343     0.999829        44330      5851.43
    7749.631     0.999854        44331      6826.67
    7761.919     0.999878        44332      8192.00
    7786.495     0.999890        44333      9102.22
    7786.495     0.999902        44333     10240.00
    7811.071     0.999915        44334     11702.86
    7811.071     0.999927        44334     13653.33
    7843.839     0.999939        44335     16384.00
    7843.839     0.999945        44335     18204.44
    7843.839     0.999951        44335     20480.00
    7864.319     0.999957        44336     23405.71
    7864.319     0.999963        44336     27306.67
    7864.319     0.999969        44336     32768.00
    7864.319     0.999973        44336     36408.89
    7864.319     0.999976        44336     40960.00
    7892.991     0.999979        44337     46811.43
    7892.991     1.000000        44337          inf
#[Mean    =     4378.378, StdDeviation   =     1181.390]
#[Max     =     7888.896, Total count    =        44337]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  65715 requests in 30.00s, 46.00MB read
Requests/sec:   2190.30
Transfer/sec:      1.53MB